# Python: Сигнатура функции
#
# Функция pow() возводит число в степень. Она принимает два параметра: какое число возводить и в какую степень возводить. Если вызывать pow() без параметров, то Python выдаст следующее: "TypeError: pow expected at least 2 arguments, got 0". Интерпретатор сообщает, что функция ожидает два параметра, а вы вызвали ее без них.
#
# Функция pow() всегда имеет два обязательных параметра, поэтому ее невозможно вызвать с другим количеством параметров.
#
# Более того, параметрами pow() могут быть только числа. Например, если передать в нее пару строк, это приведет к следующей ошибке: "TypeError: unsupported operand type(s) for ** or pow(): 'str' and 'str'". Результат вызова функции — тоже всегда число.
#
# Другая функция может иметь другое число параметров и другие типы параметров. Например, может существовать функция, которая принимает три параметра: число, строку и еще одно число.
#
# Чтобы знать такие подробности о конкретной функции, нужно изучать ее сигнатуру. Она определяет входные параметры и их типы, а также выходной параметр и его тип. Про функцию pow() можно почитать в официальной документации Python или в неофициальной документации на русском языке. Обычно документация для функции выглядит так:
#
# pow(x, y[, z])
#
# Возвращает x в степени y; если z присутствует, возвращает x в степени y, по модулю z
#
# Первая строка здесь — это сигнатура функции. У функции два обязательных параметра — x и y. Необязательный параметр z указан в квадратных скобках. Следом поясняется, для чего функция нужна. Документация дает понять, сколько аргументов у функции и какого они типа. Также она описывает, что возвращает функция и какого типа будет возвращаемое значение.
# Задание
#
# Теперь ваша очередь посмотреть на сигнатуру функции в документации и разобраться, как её использовать.
#
# В Python есть функция hex(). Изучите её сигнатуру на странице документации.
#
# Напишите программу, которая выведет на экран результат работы функции hex() с переменной number в качестве параметра.
#
# Определения
#
#     Сигнатура функции — формальное описание типов аргументов и типа возвращаемого значения функции.

number = 255

# BEGIN (write your solution here)
print(hex(number))
# END
