#Python: Привет, Мир!
#
#Изучение нового языка программирования традиционно начинается с 'Hello, World!'. Это простая программа, которая выводит приветствие на экран и заодно знакомит с новым языком — его синтаксисом и структурой программы.
#
#  Hello, World!
#
#Этой традиции уже больше сорока лет, поэтому и мы не будем нарушать ее. В первом уроке мы напишем программу Hello, World!. Чтобы сделать это, нужно дать компьютеру специальную команду. В языке Python это — print().
#Задание
#
#Наберите в редакторе код из задания символ в символ и нажмите «Проверить».
#
#print('Hello, World!')
#
#Внимание: если вы напишете heLLo, woRld! вместо Hello, World!, то это будет считаться другим текстом, потому что заглавные и строчные буквы — это разные символы, отличающиеся регистром. В программировании регистр практически всегда имеет значение, поэтому привыкайте всегда обращать на него внимание!


print('Hello, World!')
