# Python: Переменные и конкатенация
#
# Попробуем использовать переменные с конкатенацией, при этом синтаксически ничего не поменяется. Мы умеем конкатенировать две строки:
#
# what = "Kings" + "road"
# print(what)  # => Kingsroad
#
# Значит, мы сумеем склеить строку и одну переменную, в которой записана строка:
#
# first = "Kings"
# what = first + "road"
#
# print(what)  # => Kingsroad
#
# А еще можно конкатенировать две переменные, в которых записаны строки:
#
# first = "Kings"
# last = 'road'
#
# what = first + last
# print(what)  # => Kingsroad
#
# https://replit.com/@hexlet/python-basics-variables-concatenation
#
# Переменные — важный инструмент в программировании. Они упрощают сложные вычисления и таким образом облегчают разработку. Но чтобы успешно работать с переменными, надо не только правильно использовать их, но и правильно называть. Об этом поговорим уже в следующем уроке.
# Задание
#
# Сайты постоянно посылают письма своим пользователям. Типичная задача — сделать автоматическую отправку персонального письма, где в заголовке будет имя пользователя. Если где-то в базе сайта хранится имя человека в виде строки, то задача генерации заголовка сводится к конкатенации: например, нужно склеить строку Здравствуйте со строкой, где записано имя.
#
# Напишите программу, которая будет генерировать заголовок и тело письма, используя уже готовые переменные, и выводить получившиеся строки на экран.
#
# Для заголовка используйте переменные first_name и greeting, запятую и восклицательный знак. Выведите это на экран в правильном порядке.
#
# Для тела письма используйте переменные info и intro, при этом второе предложение должно быть на новой строке.
#
# Результат на экране будет выглядеть так:
#
# Hello, Joffrey!
# Here is important information about your account security.
# We couldn't verify your mother's maiden name.
#
# Выполните задание, используя только два print().

info = "We couldn't verify your mother's maiden name."
intro = "Here is important information about your account security."

first_name = 'Joffrey'
greeting = 'Hello'

# BEGIN (write your solution here)
print(greeting + ', ' + first_name + '!')
print(intro + '\n' + info)
# END